Revit 2027 API
RevitLinkOptions.IsRelative Property
 The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRelative { get; set; }
Public Property IsRelative As Boolean
	Get
	Set
public:
property bool IsRelative {
	bool get ();
	void set (bool value);
}
member IsRelative : bool with get, set
Property Value
Boolean
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace